In [1]:
import pandas as pd
import numpy as np 
import pickle

In [2]:
from pandas import read_csv

In [3]:
file = read_csv("Housing.csv")
file.head()

,price,area,bedrooms,bathrooms,stories,mainroad,guestroom,basement,hotwaterheating,airconditioning,parking,prefarea,furnishingstatus
0,13300000,7420,4,2,3,yes,no,no,no,yes,2,yes,furnished
1,12250000,8960,4,4,4,yes,no,no,no,yes,3,no,furnished
2,12250000,9960,3,2,2,yes,no,yes,no,no,2,yes,semi-furnished
3,12215000,7500,4,2,2,yes,no,yes,no,yes,3,yes,furnished
4,11410000,7420,4,1,2,yes,yes,yes,no,yes,2,no,furnished

In [5]:
file.isnull().sum()

price               0
area                0
bedrooms            0
bathrooms           0
stories             0
mainroad            0
guestroom           0
basement            0
hotwaterheating     0
airconditioning     0
parking             0
prefarea            0
furnishingstatus    0
dtype: int64

In [24]:
x = file.iloc[:,1:3]
y = file.iloc[:,0:1]
y.head()

      price
0  13300000
1  12250000
2  12250000
3  12215000
4  11410000

In [25]:
x.head()

   area  bedrooms
0  7420         4
1  8960         4
2  9960         3
3  7500         4
4  7420         4

In [72]:
x = file.iloc[:,1:2]

In [73]:
x.head()

   area
0  7420
1  8960
2  9960
3  7500
4  7420

In [77]:
x.head()

   area
0  7420
1  8960
2  9960
3  7500
4  7420

In [78]:
combined = pd.concat((x,y),axis=1)

In [79]:
combined.head()

   area     price
0  7420  13300000
1  8960  12250000
2  9960  12250000
3  7500  12215000
4  7420  11410000

In [80]:
combined.to_csv("NewHousing.csv")

In [82]:
from sklearn.linear_model import LinearRegression
clf=LinearRegression()
clf.fit(x,y)
#checking our score 
clf.score(x,y)

0.2872931546811468